; domain
(define (domain blockWorld)
  (:requirements :strips :typing)
  (:types block)
  (:predicates
    (on ?x - block ?y - block)
    (ontable ?x - block)
    (clear ?x - block)
    (handempty)
    (holding ?x - block))
  (:action pick-up
    ;;; action qui ramasse un bloc pose sur la table
    :parameters (?x - block)
    :precondition (and (clear ?x) (ontable ?x) (handempty))
    :effect (and (not (ontable ?x))
            (not (clear ?x))
            (not (handempty))
            (holding ?x)))
  (:action unstack
    ;;; action qui ramasse un bloc pose sur un autre
    :parameters (?x - block ?y - block)
    :precondition (and (clear ?x) (on ?x ?y) (handempty))
    :effect (and (not (on ?x ?y))
            (not (clear ?x))
            (not (handempty))
            (holding ?x)
            (clear ?y)))
  (:action put-down
    ;;; action qui pose un bloc sur la table
    :parameters (?x - block)
    :precondition (holding ?x)
    :effect (and (not (holding ?x))
            (clear ?x)
            (handempty)
            (ontable ?x)))
  (:action stack
    ;;; action qui pose un bloc sur un autre
    :parameters (?x - block ?y - block)
    :precondition (and (holding ?x) (clear ?y))
    :effect (and (not (holding ?x))
            (not (clear ?y))
            (clear ?x)
            (handempty)
            (on ?x ?y))))

; problem
(define (problem blockProblem)
  (:domain blockWorld)
  (:objects A B C D E F G H I J - block)
  (:init (ontable A)
         (on B A)
         (on C B)
         (clear C)
         (ontable D)
         (on E D)
         (on F E)
         (clear F)
         (ontable G)
         (clear G)
         (ontable I)
         (on J H)
         (on H I)
         (clear J)
         (handempty))
  (:goal (and (ontable J)
         (on A B) 
         (on B C) 
         (on C D)
         (on D E)
         (on E F)
         (on F G)
         (on G H)
         (on H I)
         (on I J)
         (clear A) 
         (handempty))))

; plan
1. (unstack j h)
   deleted: (on j h) (clear j) (handempty)
   added: (holding j) (clear h)
   goals met: 1 of 12
2. (put-down j)
   deleted: (holding j)
   added: (clear j) (handempty) (ontable j)
   goals met: 3 of 12
3. (unstack h i)
   deleted: (on h i) (clear h) (handempty)
   added: (holding h) (clear i)
   goals met: 1 of 12
4. (stack h f)
   deleted: (holding h) (clear f)
   added: (clear h) (handempty) (on h f)
   goals met: 2 of 12
5. (pick-up i)
   deleted: (ontable i) (clear i) (handempty)
   added: (holding i)
   goals met: 1 of 12
6. (stack i j)
   deleted: (holding i) (clear j)
   added: (clear i) (handempty) (on i j)
   goals met: 3 of 12
7. (unstack h f)
   deleted: (on h f) (clear h) (handempty)
   added: (holding h) (clear f)
   goals met: 2 of 12
8. (stack h i)
   deleted: (holding h) (clear i)
   added: (clear h) (handempty) (on h i)
   goals met: 4 of 12
9. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 3 of 12
10. (stack g h)
   deleted: (holding g) (clear h)
   added: (clear g) (handempty) (on g h)
   goals met: 5 of 12
11. (unstack f e)
   deleted: (on f e) (clear f) (handempty)
   added: (holding f) (clear e)
   goals met: 4 of 12
12. (stack f g)
   deleted: (holding f) (clear g)
   added: (clear f) (handempty) (on f g)
   goals met: 6 of 12
13. (unstack e d)
   deleted: (on e d) (clear e) (handempty)
   added: (holding e) (clear d)
   goals met: 5 of 12
14. (stack e f)
   deleted: (holding e) (clear f)
   added: (clear e) (handempty) (on e f)
   goals met: 7 of 12
15. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 6 of 12
16. (stack d e)
   deleted: (holding d) (clear e)
   added: (clear d) (handempty) (on d e)
   goals met: 8 of 12
17. (unstack c b)
   deleted: (on c b) (clear c) (handempty)
   added: (holding c) (clear b)
   goals met: 7 of 12
18. (stack c d)
   deleted: (holding c) (clear d)
   added: (clear c) (handempty) (on c d)
   goals met: 9 of 12
19. (unstack b a)
   deleted: (on b a) (clear b) (handempty)
   added: (holding b) (clear a)
   goals met: 9 of 12
20. (stack b c)
   deleted: (holding b) (clear c)
   added: (clear b) (handempty) (on b c)
   goals met: 11 of 12
21. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 9 of 12
22. (stack a b)
   deleted: (holding a) (clear b)
   added: (clear a) (handempty) (on a b)
   goals met: 12 of 12
